String afterSalamRU =
    'Аллоохумма антас-салааму ваминкас-салаам, табаарокта йаа зал-жалаали вал икроом';
String afterSalamAR =
    'اَللّٰهُمَّ اَنْتَ السَّلاَمُ وَ مِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَ اْلاِكْرَامِ';
String afterSalamDesk =
    ' деп айтылат. Анан колдор көтөрүлүп, алакандар жайылып, «Солаатан тунжина» дубасы окулат:';
String solatanAR =
    'اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلىَ ٰالِ سَيِّدِنَامُحَمَّدٍ ❁\nصَلاَةً تُنْجِينَا بِهَامِنْ جَمِيعِ ﭐْلاَهْوَالِ وَﭐْلاٰفَاتِ ❁\nوَتَقْضِى لَنَا بِهَاجَمِيعَ الْحَجَاتِ ❁\nوَتُطَهِّرُنَا بِهَامِنْ جَمِيعِﭐلسَّيِّئَاتِ ❁\nوَتَرْفَعُنَا بِهَا عِنْدَكَ اَعْلىَﭐلدَّرَجَاتِ ❁\nوَتُبَلِّغُنَا بِهَآاَقْصىَﭐلْغَايَاتِ ❁\nمِنْ جَمِيعِﭐلْخَيْرَاتِ ﭐلْحَيَاةِ وَبَعْدَ الْمَمَاتِ ❁\nبِرَحْمَتِكَ يَآاَرْحَمَ الرَّاحِمِينَ ❁بِحُرْمَةِ حَبِيبِكَ يَآاَرْحَمَ الرَّاحِمِينَ ❁\nبِحُرْمَةِ جَمِيعِ اْلاَنْبِيَآءِ وَاْلاَوْلِيَآءِ ﭘِيرِ ﭘِيراَنِ ﭘِيرِ اَعْظَمِ يَآاَرْحَمَ الرَّاحِمِينَ ❁\nٰامِينَ ❁\nوَسَلاَمٌ عَليَ الْمُرْسَلِينَ ❁\nوَالْحَمْدُ ِللهِ رَبِّ الْعَالَمِينَ❁';
String solatanRU =
    "Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали сайиидинаа Мухаммад, солаатан тунжинаа бихаа мин жамии'ил ахваали вал аафаат. Ва такдий ланаа бихаа жамии'ал хаажаат, ва тутоххирунаа бихаа мин жамии'ис саййи-аати, ва тарфау'наа бихаа 'индака аа'лад дарожаат, ва тубаллигунаа бихаа аксолөгоойаат, мин жамии'ил хойрооти фил хайаати ва баа'дал мамаат, аамиин, йаа Мужибад да'аваат, вал хамду лиллаахи Роббил 'ааламиин";
String solatanDesk = ' деп алакандар бетке сүртүлөт.';
String navAferSolatan = 'Бул дубадан кийин тасбихат улантылат:';
String nukaddimuAR =
    'اللَّهُمَّ اِنَّا نُقَدِّمُ اِلَيْكَ بَيْنَ يَدَيْ كُلِّ نَفَسٍ وَلَمْحَتٍ وَلَحْظَتٍ وَطَرْفَتٍ يَتْرِفُ بِهَآ اَهْلُ السَّمَوَتِ اَهْلُ الْاَرَضِينَ شَهَادَتً اشْهَدُ اَنْ';
String nukaddimuRU =
    'Аллоохумма  иннаа нукаддиму илайка байна йаадай кулли нафасин ва ламхатин ва лахзотин ва торфатин йатрифу бихаа ахлус-самааваати ва ахлул ародийна шахааада; Ашхаду ан...';
String nukaddimuDesk = ' (бул жерге чейин 1 жолу окулат)';
String shahaadaAR =
    'لآَ اِلٰهَ اِلاَّ اللّٰهُ وَحْدَهُ لآَ شَر۪يكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْي۪ى وَ يُم۪يتُ وَ هُوَ حَىٌّ لاَ يَمُوتُ بِيَدِهِ الْخَيْرُ وَ هُوَ عَلٰى كُلِّ شَىْءٍ قَد۪يرٌ';
String shahaadaRU =
    "Лаа илааха иллаллоху вахдахуу лаа шарийка лах, лахул-мулку валахул-хамду йухйи ва йумиит, ва хува хаййун лаа ямуут, биядихил-хойр, ва хува 'алаа кулли шай-ин кодиир";
String shahaadaDesk = ' (10 жолу окуп, 10-нун аягында)';
String uaIlayhilAR = 'وَ اِلَيْهِ الْمَص۪يرُ';
String uaIlayhilRU = 'ва илайхил-масыйр';
String uaIlayhilDesk = ' (кошулат).';
String navAfteruaIlayhil =
    'Истиаза дубалары окулат (колдор которулуп, алакан томон каратылат):';
String azhirnaAR = 'اَللّٰهُمَّ اَجِرْنَا مِنَ النَّارِ';
String azhirnaRU = 'Аллоохумма ажирнаа минан-наар';
String azhirnaDesk = ' (3, 5 же 7 жолу окулат)';
String azhirnaLongAR =
    'اَللّٰهُمَّ اَجِرْنَا مِنْ كُلِّ نَارٍ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ الدّ۪ينِيَّةِ وَ الدُّنْيَوِيَّةِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ اٰخِرِ الزَّمَانِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ الْمَس۪يحِ الدَّجَّالِ وَ السُّفْيَانِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنَ الضَّلاَلاَتِ وَ الْبِدْعِيَّاتِ وَ الْبَلِيَّاتِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ شَرِّ النَّفْسِ اْلاَمَّارَةِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ شُرُورِ النُّفُوسِ اْلاَمَّارَاتِ الْفِرْعَوْنِيَّةِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ شَرِّ النِّسَٓاءِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ بَلآَءِ النِّسَٓاءِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ النِّسَٓاءِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ الْقَبْرِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ يَوْمِ الْقِيٰمَةِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ جَهَنَّمَ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ قَهْرِكَ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ نَارِ قَهْرِكَ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ الْقَبْرِ وَ النِّرَانِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنَ الرِّيَاءِ وَ السُّمْعَةِ وَ الْعُجُبِ وَ الْفَخْرِ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ تَجَاوُزِ الْمُلْحِد۪ينَ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ شَرِّ الْمُنَافِق۪ينَ ❁\n اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ الْفَاسِق۪ينَ ❁\n اَللّٰهُمَّ اَجِرْنَا وَ اَجِرْ وَالِدَيْنَا وَ طَلَبَةَ رَسَٓائِلِ النُّورِ الصَّدِق۪ينَ ف۪ى خِدْمَةِ الْقُرْاٰنِ وَ اْلا۪يمَانِ وَ اَحْبَابَنَا الْمُؤْمِن۪ينَ الْمُخْلِص۪ينَ وَ اَقْرِبَٓائَنَا وَ اَجْدَادَنَا مِنَ     النَّارِ❁';
String azhirnaLongRU =
    "❁ Аллоохумма ажирнаа мин кулли наар.\n❁ Аллоохумма ажирнаа мин фитнатид-дииниййати вад-дунйавиййа.\n❁ Аллоохумма ажирнаа мин фитнати аахириз замаан.\n❁ Аллоохумма ажирнаа мин фитнатил масийхид-дажжаали вас-суфйаан.\n❁ Аллоохумма ажирнаа минад-долаалати вал бид'иййати вал балиййаат.\n❁ Аллоохумма ажирнаа мин шаррин нафсил аммаро.\n❁ Аллоохумма ажирнаа мин шуруурин нуфуусил аммаароотил фир'авниййа.\n❁ Аллоохумма ажирнаа мин шаррин нисаа.\n❁ Аллоохумма ажирнаа мин балаа-ин нисаа.\n❁ Аллоохумма ажирнаа мин фитнатин нисаа.\n❁ Аллоохумма ажирнаа мин 'азабил кобр.\n❁ Аллоохумма ажирнаа мин 'азааби яумил кыййаама.\n❁ Аллоохумма ажирнаа мин 'азааби жаханнам.\n❁ Аллоохумма ажирнаа мин 'азааби кохрик.\n❁ Аллоохумма ажирнаа мин наари кохрик.\n❁ Аллоохумма ажирнаа мин 'азабил кобри ван нийроон.\n❁ Аллоохумма ажирнаа минар рийаа-и вас сум'ати вал'ужуби вал фахр.\n❁ Аллоохумма ажирнаа мин тажаавузил мулхидиин.\n❁ Аллоохумма ажирнаа мин шаррил мунаафикиин.\n❁ Аллоохумма ажирнаа мин фитнатил фаасикиин.\n❁ Аллоохумма ажирнаа ва ажир ваалидайнаа ва толабата Росаа-илин нуурис-соодикийна фий хидматил кур-аани вал-иймаан, ва ахбаабанал му-миниинал мухлисыйна ва акрибаа-анна ва аждааданаа минан наар.";
String azhirnaLongDesk = ' (ушул жерде алакандар жогору каратылат)';
String biawfikaAR =
    'بِعَفْوِكَ يَا مُجِيرُ بِفَضْلِكَ يَا غَفَّرُ اَللَّهُمَّ اَدْخِلْنَا اجَنَّةَ مَعَ الْاَبْرَارِ';
String biawfikaRU =
    "Би 'афвика йаа Мужиир, бифадлика йаа Гоффаар. Аллоохумма адхинал жанната ма'ал аброор.";
String biawfikaDesk = '\n(бул 3 жолу айтылат)';
String adhilnaAR =
    'اَللَّهُمَّ اَدْخِلْنَا وَ اَدْخِلْ اُسْتَاذَنَا وَوَالِدَيْنَا وَطَلَبَةَ رَسَآءِلِ النُّورِ الصَّادِقِينَا وَ اِخْوَنَنَا وَ اَخَوَاتَنَا وَ اَقْرِبَآءَنَا وَ اَجْدَادَنَا وَاَحْبَابَنَا الْمُؤْمِنِينَ الْمُخْلِصِينَ فِى خِدْمَةِ الْاِيمَانِ وَالْقُرْاأَنِ ❁ الْجَنَّةَ مَعَ الْاَبْرَارِ بِشَفَاعَةِ نَبِيِّكَ الْمُخْتَارِ وَاأَلِهِ الْاَطْهَارِ وَ اَصْحَابِهِ الْاَخْيَرِ وَسَلَّمْ مَا دَامَ اللَّيْلُ وَالنَّهَارُ ❁ أَمِيْنَ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ';
String adhilnaRU =
    "Аллоохумма адхилнаа ва адхил устаазанаа ва ваалидайнаа ва толабата росса-илин нуурис соодикийна ва ихваананаа ва аховаатанаа ва акрибаа-анаа ва аждааданаа ва ахбаабанал му-миниинал мухлисыйна фий хидматил  иймаани вал кур-аан, ал жанната  ма'ал аброор, би шафаа'aти набиййикал мухтаар ва аалихил атхаар ва асхаабихил ахйаар васаллим маа даамал  лайлу ван нахаар. Аамиин, вал хамду лиллаахи Роббил 'ааламиин.";
String adhilnaDesk = ' (Алакандар бетке суртулот)';
String navAferAdhilna = 'Анан намаздын аягындагы тасбихке отобуз:';
String subhanAllohiAR =
    'سُبْحَانَ اللهِ وَالْحَمْدُ ِللهِ وَلآَاِلٰهَ اِلاََّ الله ُ وَالله ُ اَكْبَرُ ❁ وَلاَحَوْلَ وَلاَقُوَّةَ اِلاَّبِاللهِ الْعَلِيِّ الْعَظِيمِ';
String subhanAllohiRU =
    "Субхааналлохи вал хамду лиллаахи ва лаа илааха иллаллооху валлоху акбар, ва лаа хавла ва лаа куввата иллаа биллахил 'алиййил 'азыйм";
String subhanAllohiDesk = ' деп айтылат жана «Аятал Курси» окулат:';
String bismiAR = 'بِسْـــــمِ اللهِ الرَّحْمٰنِ الرَّحِيـمِ';
String bismiRU = 'Бисмиллаахир Рахмаанир Рахиим.\n';
String ayatulKursiAR =
    'اَلله ُلآَ اِلَهَ اِلاَّ هُوَ الْحَيُّ اْلقَيُّومُ ❁ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ ❁ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي اْلأَرْضِ ❁ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ اِلاَّ بِإِذْنِهِ ❁ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ❁ وَلاَ يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ اِلاَّ بِمَا شَآءَ ❁ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَاْلأَرْضَ ❁ وَلاَ يَؤُدُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ❁';
String ayatulKursiRU =
    "Аллаху ля иляха илля хуаль хаййюль къайюм, ля тахузуху синнатун ва ля наум. Ляху ма фий ссаммавати ва ма филь ардъ, ман заллязий яшфа'у индаху илля биизнихи, я'аляму ма байна айдихим ва ма хъальфахум, ва ля юхийтуна бишейин мин 'ильмихи илля бима шаа васи'а курсийюху ссаммвати валь ард, ва ля йаудуху хифзухума ва хуаль 'алиюль 'азъыйм";
String ayatulKursiDesk = '';
String navAfterAyatulKursi = 'Намаз тасбихтери айтылат: ';
String subhanaAllohAR = 'سُُبْحَانَ اللّٰهِ';
String subhanaAllohRU = 'Субхааналлоох';
String subhanaAllohDesk = ' (33 жолу),';
String alhamdulillahAR = 'اَلْحَمْدُ لِلّٰهِ';
String alhamdulillahRU = 'Алхамду лиллаах';
String alhamdulillahDesk = ' (33 жолу),';
// ignore: non_constant_identifier_names
String AllohuAkbarAR = 'اَللّٰهُ اَكْبَرُ';
// ignore: non_constant_identifier_names
String AllohuAkbarRU = 'Аллооху акбар';
// ignore: non_constant_identifier_names
String AllohuAkbarDesk = ' (33 жолу),';
String uahdahuAR =
    'آَاِلٰهَ اِلاَّاللّٰهُ وَحْدَهُ لاَشَرِ يكَ لَهُ ❁ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِى وَيُمِيتُ ❁ وَهُوَالْحَيُّ الَّذِي لاَيَمُوتُ بِيَدِهِﭐلْخَيْرُ ❁ وَهُوَ عَلٰى كُلِّ شَىْءٍقَدِيرٌ ❁ وَاِلَيْهِ الْمَصِيرُ ❁ ❁';
String uahdahuRU =
    "Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул мулку  ва лахул хамду йухйии ва йумиит, ва хува хаййун лаа ямуут, биядихил хойр, ва хува 'алаа кулли  шай-ин кодиир ва илайхил масыйр";
String uahdahuDesk =
    ' деп айтылып дуба кылынат. Дубадан кийинки тасбихат улантылыт.';
String falamAR = 'فَاعْلَمْ اَنَّهُ';
String falamRU = "Фа'лам аннаху";
String falamDesk = ' (1 жолу),';
String lailahaAR = 'لآَاِلٰهَ اِلاَّالله';
String lailahaRU = 'Лаа илааха иллаллоох';
String lailahaDesk =
    ' (33 жолу окулат. Каалагандар багымдат жана куптан намаздардан кийин 100 жолу окуса болот.)';
// ignore: non_constant_identifier_names
String MuhammadAR =
    'مُحَمَّدٌ رَسُولُ اللّٰهِ صَلَّى اللّٰهُ تَعَالٰى عَلَيْهِ وَ سَلَّمَ';
// ignore: non_constant_identifier_names
String MuhammadRU =
    "Мухаммадун Расуулуллоохи соллаллооху та'аала 'алайхи ва саллам";
// ignore: non_constant_identifier_names
String MuhammadDesk = '(делет)';
String navAfterMuhammad = '*Тасбихаттагы салаату-саламда  р окулат:';

String afterMuhammadAR =
    'لآَاِلٰهَ اِلاَّالله ُ اَلْمَلِكُ الْحَقُّ الْمُبِينُ ❁ مُحَمَّدٌرَسُولُﭐللهِ صَادِقُ الْوَعْدِ اْلاَمِينُ';
String afterMuhammadRU =
    "Лаа илааха иллаллоохул маликул хаккул мубиин, Мухаммадун расуулуллоохис соодикул ва'дил амиин.";

String afterMuhammadDesk =
    "(Багымдат намазда гана 10 жолу окулат.)\nТасбихаттагы салаату-саламдар окулат:";

String innAllohAR =
    'اِنَّ اللّٰهَ وَ مَلَٓئِكَتَهُ يُصَلُّونَ عَلَى النَّبِىِّ يَٓا اَيُّهَا الَّذ۪ينَ اٰمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْل۪يمًا ❁ لَبَّيْكَ\n❁  ❁  ❁  ❁  ❁\n اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَٓاءٍ وَدَوَٓاءٍ وَبَارِكْ وَسَلِّمْ عَلَيْهِ وَعَلَيْهِمْ تَسْلِيمًا كَثِيرًا  اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَٓاءٍ وَدَوَٓاءٍ وَبَارِكْ وَسَلِّمْ عَلَيْهِ وَعَلَيْهِمْ تَسْلِيمًا كَثِيرًا  اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَٓاءٍ وَدَوَٓاءٍ وَبَارِكْ وَسَلِّمْ عَلَيْهِ وَعَلَيْهِمْ تَسْلِيمًا كَثِيرًا كَثِيرًا\n❁  ❁  ❁  ❁  ❁\n صَلِّ وَ سَلِّمْ يَا رَبِّ عَلٰى حَب۪يبِكَ مُحَمَّدٍ وَ عَلٰى جَم۪يعِ اْلاَنْبِيَٓاءِ وَ لْمُرْسَل۪ينَ وَ عَلَٓى اٰلِ كُلٍّ وَ صَحْبِ كُلٍّ اَجْمَع۪ينَ اٰم۪ينَ وَالْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَ \n❁  ❁  ❁  ❁  ❁\n اَلْفُ اَلْفِ صَلاَةٍ وَ اَلْفُ اَلْفِ سَلاَمٍ عَلَيْكَ يَا رَسُولَ اللّٰهِ اَلْفُ اَلْفِ صَلاَةٍ وَ اَلْفُ اَلْفِ سَلاَمٍ عَلَيْكَ يَا حَب۪يبَ اللّٰهِ  اَلْفُ اَلْفِ صَلاَةٍ وَ اَلْفُ اَلْفِ سَلاَمٍ عَلَيْكَ يَٓا اَم۪ينَ وَحْىِ اللّٰهِ \n❁  ❁  ❁  ❁  ❁\n اَللّٰهُمَّ صَلِّ وَ سَلِّمْ وَ بَارِكْ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِه۪ وَ اَصْحَابِه۪ بِعَدَدِ اَوْرَاقِ اْلاَشْجَارِ وَ اَمْوَاجِ الْبِحَارِ وَ قَطَرَاتِ اْلاَمْطَارِ وَ اغْفِرْلَنَا وَ ارْحَمْنَا وَ الْطُفْ بِنَا وَ بِاُسْتَادِنَا سَع۪يدِ النُّورْس۪ى رَضِىَ اللّٰهُ عَنْهُ وَ وَالِدَيْنَا وَ بِطَلَبَةِ رَسَٓائِلِ النُّورِ الصَّدِق۪ينَ يَٓا اِلٰهَنَا بِكُلِّ صَلاَةٍ مِنْهَٓا اَشْهَدُ اَنْ لآَ اِلٰهَ اِلاَّ اللّٰهُ وَ اَشْهَدُ اَنَّ مُحَمَّدًا رَسُولُ اللّٰهِ صَلَّى اللّٰهُ تَعَالٰى عَلَيْهِ وَ سَلَّمْ';
String innAllohRU =
    "❁ Инналлооха ва малаа-икатахуу йусоллууна 'алан набийй, йаа аййухаллазийна аамануу соллуу 'алайхи васаллимуу таслиймаа, лаббайк!\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийроо.\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийроо.\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийрон касийроо.\n❁ Солли васаллим йаа Робби'алаа хабийбика Мухаммадин ва'алаа жамии'ил анбийаа-и вал мурсалиин, ва'алаа аали куллин ва сохби куллин ажма'иин. Аамиин, вал хамду лиллаахи Роббил'ааламин.\n❁ Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа расуулаллоох.\n❁ Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа хабиибаллоох.\n❁ Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа амиина вахйиллаах.\n❁ Аллоохумма солли васаллим ва баарик 'алаа саййидинаа Мухаммадин ва 'алаа аалихи ва асхаабих, би адади авроокил ашжаари ва амваажил бихаари ва катороотил амтоор, вагфир ланаа варxамнаа валтуф бинаа ва би устаазинаа ва ваалидайнаа ва битолабати росаа-илин нуурис-соодикиин, йаа илааханаа би кулли солаатин минхаа шахаадах, ашхаду ан лаа илааха иллаллоох, ва ашхаду анна Мухаммадан Расуулуллоохи соллаллооху та'аала 'алайхи ва саллам.";
String innAllohDesk = '';
String navAfterInnAlloh = '';
String subhanakaYaaAllahAR =
    'سُبْحَانَك يَٓا اَللّٰهُ تَعَالَيْتَ يَا رَحْمٰنُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا رَح۪يمُ تَعَالَيْتَ يَا كَر۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَم۪يدُ تَعَالَيْتَ يَا حَك۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مَج۪يدُ تَعَالَيْتَ يَا مَلِكُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰن \nسُبْحَانَكَ يَا قُدُّوسُ تَعَالَيْتَ يَا سَلاَمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُؤْمِنُ تَعَالَيْتَ يَا مُهَيْمِنُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَز۪يزُ تَعَالَيْتَ يَا جَبَّارُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُتَكَبِّرُ تَعَالَيْتَ يَا خَالِقُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَٓا اَوَّلُ تَعَالَيْتَ يَٓا اٰخِرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا ظَاهِرُ تَعَالَيْتَ يَا بَاطِنُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا بَارِىءُ تَعَالَيْتَ يَا مُصَوِّرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا تَوَّابُ تَعَالَيْتَ يَا وَهَّابُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا بَاعِثُ تَعَالَيْتَ يَا وَارِثُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا قَد۪يمُ تَعَالَيْتَ يَا مُق۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا فَرْدُ تَعَالَيْتَ يَا وِتْرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا نُورُ تَعَالَيْتَ يَا سَتَّارُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا جَل۪يلُ تَعَالَيْتَ يَا جَم۪يلُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا قَاهِرُ تَعَالَيْتَ يَا قَادِرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مَل۪يكُ تَعَالَيْتَ يَا مُقْتَدِرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَل۪يمُ تَعَالَيْتَ يَا عَلاَّمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَظ۪يمُ تَعَالَيْتَ يَا غَفُورُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَل۪يمُ تَعَالَيْتَ يَا وَدُودُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا شَه۪يدُ تَعَالَيْتَ يَا شَاهِدُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا كَب۪يرُ تَعَالَيْتَ يَا مُتَعَالُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا نُورُ تَعَالَيْتَ يَا لَط۪يفُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا سَم۪يعُ تَعَالَيْتَ يَا كَف۪يلُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا قَر۪يبُ تَعَالَيْتَ يَا بَص۪يرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَقُّ تَعَالَيْتَ يَا مُب۪ينُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا رَؤُفُ تَعَالَيْتَ يَا رَح۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا طَاهِرُ تَعَالَيْتَ يَا مُطَهِّرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُجَمِّلُ تَعَالَيْتَ يَا مُفَضِّلُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُظْهِرُ تَعَالَيْتَ يَا مُنْعِمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا دَيَّانُ تَعَالَيْتَ يَا سُلْطَانُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَنَّانُ تَعَالَيْتَ يَا مَنَّانُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَٓا اَحَدُ تَعَالَيْتَ يَا صَمَدُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَىُّ تَعَالَيْتَ يَا قَيُّومُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَدْلُ تَعَالَيْتَ يَا حَكَمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا فَرْدُ تَعَالَيْتَ يَا قُدُّوسُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ';
String subhanakaYaaAllahRU =
    "❁ Субхаанака йаа Аллаах та'аалайта йаа Рохмаан ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Рахиим та'аалайта йаа Кариим ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Хамиид та'аалайта йаа Хакиим ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Мажиид та'аалайта йаа Малик ажирнаа минан наар би 'афвика Йaa Рохмаан.\n❁ Субхаанака йаа Куддуус та'аалайта йаа Салаам ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Му-мин та'аалайта йаа Муxаймин ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа 'Азииз та'аалайта йаа Жаббаар ажирнаа минан наар би 'афвика йаа Рохмаан. \n❁ Субхаанака йаа Мутакаббир та'аалайта йаа Хоолик ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Аввал та'аалайта йаа Аахир ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Зоохир та'аалайта йаа Баатын ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Баари та'аалайта йаа Мусаввир ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Таввааб та'аалайта йаа Вахтааб ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Баа'ис та'аалайта йаа Ваарис ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Кодиим та'аалайта йаа Мукиим ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Фард та'аалайта йаа Витр ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Нуур та'аалайта йаа Саттаар ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Жалиил та'аалайта йаа Жамиил ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Коохир та'аалайта йаа Коодир ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Малиик та'аалайта йаа Муктадир ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа “Алиим та'аалайта йаа Аллаам ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа 'Азыйм та'аалайта йаа Гофуур ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Халиим та'аалайта йаа Вадууд ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Шахиид та'аалайта йаа Шаахид ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Кабиир та'аалайта йаа Мута'аал ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Нуур та'аалайта йаа Латыйф ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Самии' та'аалайта йаа Кафиил ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Корииб та'аалайта йаа Басыйр ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Хакк та'аалайта йаа Мубийн ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Po-ууф та'аалайта йаа Рахиим ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Тоохир та'аалайта йаа Мутоххир ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Мужaммил та'аалайта йаа Муфаддыл ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Музхир та'аалайта йаа Мун'им ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Даййаан та'аалайта йаа Султоон ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Ханнаан та'аалайта йаа Маниаан ажирнаа минан наар би афвина йаа Рохмаан.\n❁ Субхаанака йаа Ахад та'аалайта йаа Сомад ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Хайй та'аалайта йаа Каййуум ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа 'Адл та'аалайта йаа Хакам ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака йаа Фард та'аалайта йаа Куддуус ажирнаа минан наар би 'афвика йаа Рохмаан.\n❁ Субхаанака аахиййан шарооxиййан та'аалайта лаа илааха иллаа анта ажирнаа ва ажир устаазанаа ва ваалидайнаа ва ихваананаа ва аховаaтанаа ва толабата pocaa-илин нуури ва руфакоо-анаа ва акрибаа-анаа ва ахбаабанал мухлисыйна минан наар,";
