String afterSalamRU =
    '«Аллоохумма антас-салааму ваминкас-салаам, табаарокта йаа зал-жалаали вал икроом»';
String afterSalamAR =
    'اَللّٰهُمَّ اَنْتَ السَّلاَمُ وَ مِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَ اْلاِكْرَامِ';
String afterSalamDesk =
    ' деп айтылат. Анан колдор көтөрүлүп, алакандар жайылып, «Солаатан тунжина» дубасы окулат:';
String solatanAR =
    'اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلىَ ٰالِ سَيِّدِنَامُحَمَّدٍ٭ صَلاَةً تُنْجِينَا بِهَامِنْ جَمِيعِ ﭐْلاَهْوَالِ وَﭐْلاٰفَاتِ٭ وَتَقْضِى لَنَا بِهَاجَمِيعَ الْحَجَاتِ٭ وَتُطَهِّرُنَا بِهَامِنْ جَمِيعِﭐلسَّيِّئَاتِ٭ وَتَرْفَعُنَا بِهَا عِنْدَكَ اَعْلىَﭐلدَّرَجَاتِ٭ وَتُبَلِّغُنَا بِهَآاَقْصىَﭐلْغَايَاتِ٭ مِنْ جَمِيعِﭐلْخَيْرَاتِ ﭐلْحَيَاةِ وَبَعْدَ الْمَمَاتِ٭ بِرَحْمَتِكَ يَآاَرْحَمَ الرَّاحِمِينَ ٭بِحُرْمَةِ حَبِيبِكَ يَآاَرْحَمَ الرَّاحِمِينَ٭ بِحُرْمَةِ جَمِيعِ اْلاَنْبِيَآءِ وَاْلاَوْلِيَآءِ ﭘِيرِ ﭘِيراَنِ ﭘِيرِ اَعْظَمِ يَآاَرْحَمَ الرَّاحِمِينَ٭ ٰامِينَ٭ وَسَلاَمٌ عَليَ الْمُرْسَلِينَ٭ وَالْحَمْدُ ِللهِ رَبِّ الْعَالَمِينَ٭';
String solatanRU =
    "«Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали сайиидинаа Мухаммад, солаатан тунжинаа бихаа мин жамии'ил ахваали вал аафаат. Ва такдий ланаа бихаа жамии'ал хаажаат, ва тутоххирунаа бихаа мин жамии'ис саййи-аати, ва тарфау'наа бихаа 'индака аа'лад дарожаат, ва тубаллигунаа бихаа аксолөгоойаат, мин жамии'ил хойрооти фил хайаати ва баа'дал мамаат, аамиин, йаа Мужибад да'аваат, вал хамду лиллаахи Роббил 'ааламиин»";
String solatanDesk = ' деп алакандар бетке сүртүлөт.';
String navAferSolatan = 'Бул дубадан кийин тасбихат улантылат:';
String nukaddimuAR =
    'اللَّهُمَّ اِنَّا نُقَدِّمُ اِلَيْكَ بَيْنَ يَدَيْ كُلِّ نَفَسٍ وَلَمْحَتٍ وَلَحْظَتٍ وَطَرْفَتٍ يَتْرِفُ بِهَآ اَهْلُ السَّمَوَتِ اَهْلُ الْاَرَضِينَ شَهَادَتً اشْهَدُ اَنْ';
String nukaddimuRU =
    '«Аллоохумма  иннаа нукаддиму илайка байна йаадай кулли нафасин ва ламхатин ва лахзотин ва торфатин йатрифу бихаа ахлус-самааваати ва ахлул ародийна шахааада; Ашхаду ан...';
String nukaddimuDesk = ' (бул жерге чейин 1 жолу окулат)';
String shahaadaAR =
    'لآَ اِلَهَ اِللَّهُ وَحْدَهُ لاَ شَرِيكَ لَه، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لاَ يَمُيتُ بِيَدِهِ الْخَيْرُ وَهُوَ  عَلَى كُلِّ شَيْءٍ قَدِيرٌ';
String shahaadaRU =
    "Лаа илааха иллаллоху вахдахуу лаа шарийка лах, лахул-мулку валахул-хамду йухйи ва йумиит, ва хува хаййун лаа ямуут, биядихил-хойр, ва хува 'алаа кулли шай-ин кодиир»";
String shahaadaDesk = ' (10 жолу окуп, 10-нун аягында)';
String uaIlayhilAR = 'وَاِلَيْهِ الْمصِيرُ';
String uaIlayhilRU = '«ва илайхил-масыйр»';
String uaIlayhilDesk = ' (кошулат).';
String navAfteruaIlayhil =
    'Истиаза дубалары окулат (колдор которулуп, алакан томон каратылат):';
String azhirnaAR = 'اللَّهُمَّ أَجِرْنَا مِنْ النَّارِ';
String azhirnaRU = '«Аллоохумма ажирнаа минан-наар»';
String azhirnaDesk = ' (3, 5 же 7 жолу окулат)';
String azhirnaLongAR =
    'اللَّهُمَّ أَجِرْنَا مِنْ كُلِّ نَارٍ ❁ اللَّهُمَّ أَجِرْنَا مِنْ فِتْنَتِ الدِّينِيَّتِ وَالدُّنْيَوِيَّتِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ فِتْنَتِ آخِرِ الزَّمَانِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ فِتْنَتِ الْمَسِيحِ الدَّجَّالِ وَالسُّفْيَانِ ❁ اللَّهُمَّ أَجِرْنَا مِنَ الضَّلَالَاتِ وَالْبِدْعِيَّاتِ وَالْبَلِيَّاتِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ شَرِّ النَّفْسِ الْاَمَّارَتِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ شُرُورِ النُّفُوسِ الْاَمَّرَارَاتِ الْفِرْعَوْنِيَّتِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ شَرِّ النِّسَآءِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ بَلَآءِ النِّسَآءِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ فِتْنَتِ النِّسَآءِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ عَزَابِ الْقَبْرِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ عَزَابِ يَوْمِ الْقِيَامَتِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ عَزَابِ جَهَنَّمَ ❁ اللَّهُمَّ أَجِرْنَا مِنْ عَزَابِ قَهرِكَ ❁ اللَّهُمَّ أَجِرْنَا مِنْ نَارِ قَهْرِكَ ❁ اللَّهُمَّ أَجِرْنَا مِنْ عَزَابِ  القَبْرِ وَالْنِّيرَانِ ❁ اللَّهُمَّ أَجِرْنَا مِنَ الرِّيَآءِ وَالسُّمْعَتِ وَلْعُجُبِ وَلْفَخرِ ❁ اللَّهُمَّ أَجِرْنَا مِنْ تَجَاوُزِ الْمُلْحِدِينَ ❁ اللَّهُمَّ أَجِرْنَا مِنْ شَرِّ الْمُنَافِقِينَ ❁ اللَّهُمَّ أَجِرْنَا مِنْ فِتْنَتِ الْفَاسِقِينَ ❁ اللَّهُمَّ أَجِرْنَ وَاَجِرْ وَالِدَيْنَا وَطَلَبَتَ رَسَآءِلِ النُّورِ الصَّادِقِينَ فِى خِدْمَتِ الْقُرْآنِ وَلْاِيِمَانِ وَاَحْبَابَنَا الْمُؤْمِنِينَ الْمُخْلِصِينَ وَاَقْرِبَآءَنَا وَاَجْدَادَنَا مِنَ النَّرِ';
String azhirnaLongRU =
    "❁ Аллоохумма ажирнаа мин кулли наар.\n❁ Аллоохумма ажирнаа мин фитнатид-дииниййати вад-дунйавиййа.\n❁ Аллоохумма ажирнаа мин фитнати аахириз замаан.\n❁ Аллоохумма ажирнаа мин фитнатил масийхид-дажжаали вас-суфйаан.\n❁ Аллоохумма ажирнаа минад-долаалати вал бид'иййати вал балиййаат.\n❁ Аллоохумма ажирнаа мин шаррин нафсил аммаро.\n❁ Аллоохумма ажирнаа мин шуруурин нуфуусил аммаароотил фир'авниййа.\n❁ Аллоохумма ажирнаа мин шаррин нисаа.\n❁ Аллоохумма ажирнаа мин балаа-ин нисаа.\n❁ Аллоохумма ажирнаа мин фитнатин нисаа.\n❁ Аллоохумма ажирнаа мин 'азабил кобр.\n❁ Аллоохумма ажирнаа мин 'азааби яумил кыййаама.\n❁ Аллоохумма ажирнаа мин 'азааби жаханнам.\n❁ Аллоохумма ажирнаа мин 'азааби кохрик.\n❁ Аллоохумма ажирнаа мин наари кохрик.\n❁ Аллоохумма ажирнаа мин 'азабил кобри ван нийроон.\n❁ Аллоохумма ажирнаа минар рийаа-и вас сум'ати вал'ужуби вал фахр.\n❁ Аллоохумма ажирнаа мин тажаавузил мулхидиин.\n❁ Аллоохумма ажирнаа мин шаррил мунаафикиин.\n❁ Аллоохумма ажирнаа мин фитнатил фаасикиин.\n❁ Аллоохумма ажирнаа ва ажир ваалидайнаа ва толабата Росаа-илин нуурис-соодикийна фий хидматил кур-аани вал-иймаан, ва ахбаабанал му-миниинал мухлисыйна ва акрибаа-анна ва аждааданаа минан наар.";
String azhirnaLongDesk = ' (ушул жерде алакандар жогору каратылат)';
String biawfikaAR =
    'بِعَفْوِكَ يَا مُجِيرُ بِفَضْلِكَ يَا غَفَّرُ اَللَّهُمَّ اَدْخِلْنَا اجَنَّةَ مَعَ الْاَبْرَارِ';
String biawfikaRU =
    "«Би 'афвика йаа Мужиир, бифадлика йаа Гоффаар. Аллоохумма адхинал жанната ма'ал аброор».";
String biawfikaDesk = '\n(бул 3 жолу айтылат)';
String adhilnaAR =
    'اَللَّهُمَّ اَدْخِلْنَا وَ اَدْخِلْ اُسْتَاذَنَا وَوَالِدَيْنَا وَطَلَبَةَ رَسَآءِلِ النُّورِ الصَّادِقِينَا وَ اِخْوَنَنَا وَ اَخَوَاتَنَا وَ اَقْرِبَآءَنَا وَ اَجْدَادَنَا وَاَحْبَابَنَا الْمُؤْمِنِينَ الْمُخْلِصِينَ فِى خِدْمَةِ الْاِيمَانِ وَالْقُرْاأَنِ ❁ الْجَنَّةَ مَعَ الْاَبْرَارِ بِشَفَاعَةِ نَبِيِّكَ الْمُخْتَارِ وَاأَلِهِ الْاَطْهَارِ وَ اَصْحَابِهِ الْاَخْيَرِ وَسَلَّمْ مَا دَامَ اللَّيْلُ وَالنَّهَارُ ❁ أَمِيْنَ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ';
String adhilnaRU =
    "«Аллоохумма адхилнаа ва адхил устаазанаа ва ваалидайнаа ва толабата росса-илин нуурис соодикийна ва ихваананаа ва аховаатанаа ва акрибаа-анаа ва аждааданаа ва ахбаабанал му-миниинал мухлисыйна фий хидматил  иймаани вал кур-аан, ал жанната  ма'ал аброор, би шафаа'aти набиййикал мухтаар ва аалихил атхаар ва асхаабихил ахйаар васаллим маа даамал  лайлу ван нахаар. Аамиин, вал хамду лиллаахи Роббил 'ааламиин».";
String adhilnaDesk = ' (Алакандар бетке суртулот)';
String navAferAdhilna = 'Анан намаздын аягындагы тасбихке отобуз:';
String subhanAllohiAR =
    'سُبْحَانَ اللهِ اوَالْحَمْدُ  لِلهِ وَلَآ اِلَهَ اِلَّا اللهُ وَاللهُ اَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ اِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ';
String subhanAllohiRU =
    "«Субхааналлохи вал хамду лиллаахи ва лаа илааха иллаллооху валлоху акбар, ва лаа хавла ва лаа куввата иллаа биллахил 'алиййил 'азыйм»";
String subhanAllohiDesk = ' деп айтылат жана «Аятал Курси» окулат:';
String bismiAR = 'بِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ';
String bismiRU = 'Бисмиллаахир Рахмаанир Рахиим.\n';
String ayatulKursiAR =
    'اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ❁ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ❁ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ❁ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ❁ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ❁ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ❁ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ❁ وَلَا يَئُودُهُ حِفْظُهُمَا ❁ وَهُوَ الْعَلِيُّ الْعَظِيمُ';
String ayatulKursiRU =
    "«Аллаху ля иляха илля хуаль хаййюль къайюм, ля тахузуху синнатун ва ля наум. Ляху ма фий ссаммавати ва ма филь ардъ, ман заллязий яшфа'у индаху илля биизнихи, я'аляму ма байна айдихим ва ма хъальфахум, ва ля юхийтуна бишейин мин 'ильмихи илля бима шаа васи'а курсийюху ссаммвати валь ард, ва ля йаудуху хифзухума ва хуаль 'алиюль 'азъыйм»";
String ayatulKursiDesk = '';
String navAfterAyatulKursi = 'Намаз тасбихтери айтылат: ';
String subhanaAllohAR = 'سُبْحَانَ اللهِ';
String subhanaAllohRU = 'Субхааналлоох';
String subhanaAllohDesk = ' (33 жолу),';
String alhamdulillahAR = 'اَلْحَمْدُ لِلهِ';
String alhamdulillahRU = 'Алхамду лиллаах';
String alhamdulillahDesk = ' (33 жолу),';
// ignore: non_constant_identifier_names
String AllohuAkbarAR = 'اَللهُ اَكْبَرُ';
// ignore: non_constant_identifier_names
String AllohuAkbarRU = 'Аллооху акбар';
// ignore: non_constant_identifier_names
String AllohuAkbarDesk = ' (33 жолу),';
String uahdahuAR =
    'لَآ اِلَهَ اِلَّا اللهُ وَحْدَهُ لَا شَرِكَ لَهُ ❁ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا وَيُمُوتُ ❁ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قُدِيرٌ  وَاِلَيْهِ الْمَصِيرُ';
String uahdahuRU =
    "«Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул мулку  ва лахул хамду йухйии ва йумиит, ва хува хаййун лаа ямуут, биядихил хойр, ва хува 'алаа кулли  шай-ин кодиир ва илайхил масыйр»";
String uahdahuDesk =
    ' деп айтылып дуба кылынат. Дубадан кийинки тасбихат улантылыт.';
String falamAR = 'فَاعْلَمْ اَنَّهُ';
String falamRU = "Фа'лам аннаху";
String falamDesk = ' (1 жолу),';
String lailahaAR = 'لَآ اِلَهَ اِلَّا اللهُ';
String lailahaRU = 'Лаа илааха иллаллоох';
String lailahaDesk =
    ' (33 жолу окулат. Каалагандар багымдат жана куптан намаздардан кийин 100 жолу окуса болот.)';
// ignore: non_constant_identifier_names
String MuhammadAR =
    'مُحَمَّدٌ رَسُولُ اللهِ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَ سَلَّمَ';
// ignore: non_constant_identifier_names
String MuhammadRU =
    "Мухаммадун Расуулуллоохи соллаллооху та'аала 'алайхи ва саллам";
// ignore: non_constant_identifier_names
String MuhammadDesk = '(делет)';
String navAfterMuhammad = '*Тасбихаттагы салаату-саламда  р окулат:';
String innAllohAR =
    'اِنَّ اللهَ وَمَلَآءِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَآ اَيُّهَا الَّزِينَ اَمَنُوا صَلُّوا عَلَيْهِ وَسَلَّمُوا تَسْلِيمًا ❁ لَبَّيْكَ ❁ اللهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَآى اَلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَآءٍ وَدَوَآءٍ وَبَارِكْ وَسَلَّمْ  عَلَيْهِ وَعَلَيْهِمْ كَثِيرًا ❁ اللهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَآى اَلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَآءٍ وَدَوَآءٍ وَبَارِكْ وَسَلَّمْ  عَلَيْهِ وَعَلَيْهِمْ كَثِيرًا ❁ اللهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَآى اَلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَآءٍ وَدَوَآءٍ وَبَارِكْ وَسَلَّمْ  عَلَيْهِ وَعَلَيْهِمْ كَثِيرًا كَثِيرًا ❁ صَلِّ وَسَلِّمْ يَا رَبِّ عَلَى حَبِيبِكَ مُحَمَّدٍ وَعَلَى جَمِيعِ الْاَنْبِيَاءِ وَالْمُرْسَلِينَ وَعَلَى اَلِ كُلٍّ وَ صَحْبِ كُلٍّ اَجْمَعِينَ اَمِينَ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ❁ اَلْفُ اَلْفِ صَلَاةٍ وَ اَلْفُ اَلْفِ صَلَامٍ عَلَيْكَ يَا رَسُولَ اللهِ ❁ اَلْفُ اَلْفِ صَلَاةٍ وَ اَلْفُ اَلْفِ صَلَامٍ عَلَيْكَ يَا حَبِيبَ اللهِ ❁ اَلْفُ اَلْفِ صَلَاةٍ وَ اَلْفُ اَلْفِ صَلَامٍ عَلَيْكَ يَا اَمِينَ وَحْيِ اللهِ ❁ اَللَّهُمَّ صَلِّ وَسَلَّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى اَلِهِ وَاَصْحَابِهِ بِعَدَدِ اَوْرَاقِ الْاَشْجَارَ وَ اَمْوَجِ الْبِحَارِ وَقَطَرَاتِ الْاَمْطَارِ وَاغْفِرْ لَنَا وَارْحَمْنَا وَلْطُفْ بِنَا وَبِاُسْتَاذِنَا وَ وَالِدَيْنَا وَبِطَلَبَةِ رَسَآءِلِ النُّورِ الصَّادِقِينَ ❁ يَآ اِلَهَنَا بِكُلِّ صَلَاةٍ مِنْهَا شَهَادَةً، اَشْهَدُ اَنْ لَآ اِلَهَ اِلَّا اللهُ وَاَشْهَدُ اَنَّ مُحَمَّدًا رَسُولُ اللهِ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ';
String innAllohRU =
    "❁ Инналлооха ва малаа-икатахуу йусоллууна 'алан набийй, йаа аййухаллазийна аамануу соллуу 'алайхи васаллимуу таслиймаа, лаббайк!\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийроо.\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийроо.\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийрон касийроо.\n❁ Солли васаллим йаа Робби'алаа хабийбика Мухаммадин ва'алаа жамии'ил анбийаа-и вал мурсалиин, ва'алаа аали куллин ва сохби куллин ажма'иин. Аамиин, вал хамду лиллаахи Роббил'ааламин.";
String innAllohDesk = '';
String navAfterInnAlloh = '';
String subhanakaYaaAllah =
    'سبحانك يا الله تعالیت یا ثم أجرنا من النار بعفوك يا رحمن سبحان یا رحیم تعالیت یا گريه أجرا من النار بعفوك يا رم بكائك يا ميللہ تعالیت یا حکیم اجرنا من النار بعفوك يا ځم بكائك يا مجيد تعالي يا ملك أجرنا من النار بعفوك یا زخم بكائك يا قدوس تعالی یا لام أجرنا من النار بعفوك يا رم سبحانك يا مؤم تعالي يا شهير أجرنا من النار بعفوك يا ځم';
