String afterSalamRU =
    'Аллоохумма антас-салааму ваминкас-салаам, табаарокта йаа зал-жалаали вал икроом';
String afterSalamAR =
    '❁ اَللّٰهُمَّ اَنْتَ السَّلاَمُ وَ مِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَ اْلاِكْرَامِ';
String afterSalamDeskRU =
    'деп айтылат. Анан колдор көтөрүлүп, алакандар жайылып, «Солаатан тунжина» дубасы окулат:';
String afterSalamDeskAR =
    "after saying that, the Solatan Tunjina dua below is read by raising the hands up.";
String solatanAR =
    '❁ اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلىَ ٰالِ سَيِّدِنَامُحَمَّدٍ\n❁ صَلاَةً تُنْجِينَا بِهَامِنْ جَمِيعِ ﭐْلاَهْوَالِ وَﭐْلاٰفَاتِ\n❁ وَتَقْضِى لَنَا بِهَاجَمِيعَ الْحَجَاتِ\n❁ وَتُطَهِّرُنَا بِهَامِنْ جَمِيعِﭐلسَّيِّئَاتِ\n❁ وَتَرْفَعُنَا بِهَا عِنْدَكَ اَعْلىَﭐلدَّرَجَاتِ\n❁ وَتُبَلِّغُنَا بِهَآاَقْصىَﭐلْغَايَاتِ\n❁ مِنْ جَمِيعِﭐلْخَيْرَاتِ ﰱِ ﭐلْحَيَاةِ وَبَعْدَ الْمَمَاتِ\n❁ اٰمينَ وَالْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمينَ';
String solatanRU =
    "Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали сайиидинаа Мухаммад, солаатан тунжинаа бихаа мин жамии'ил ахваали вал аафаат. Ва такдий ланаа бихаа жамии'ал хаажаат, ва тутоххирунаа бихаа мин жамии'ис саййи-аати, ва тарфау'наа бихаа 'индака аа'лад дарожаат, ва тубаллигунаа бихаа аксолөгоойаат, мин жамии'ил хойрооти фил хайаати ва баа'дал мамаат, аамиин, йаа Мужибад да'аваат, вал хамду лиллаахи Роббил 'ааламиин";
String solatanDesk = ' деп алакандар бетке сүртүлөт.';
String navAferSolatan = 'Бул дубадан кийин тасбихат улантылат:';
String nukaddimuAR =
    '❁ اللَّهُمَّ اِنَّا نُقَدِّمُ اِلَيْكَ بَيْنَ يَدَيْ كُلِّ نَفَسٍ وَلَمْحَتٍ وَلَحْظَتٍ وَطَرْفَتٍ يَتْرِفُ بِهَآ اَهْلُ السَّمَوَتِ اَهْلُ الْاَرَضِينَ شَهَادَتً اشْهَدُ اَنْ';
String nukaddimuRU =
    'Аллоохумма  иннаа нукаддиму илайка байна йаадай кулли нафасин ва ламхатин ва лахзотин ва торфатин йатрифу бихаа ахлус-самааваати ва ахлул ародийна шахааада; Ашхаду ан...';
String nukaddimuDesk = ' (бул жерге чейин 1 жолу окулат)';

String shahaadaAR =
    'لآَ اِلٰهَ اِلاَّ اللّٰهُ وَحْدَهُ لآَ شَريكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْيى وَ يُميتُ وَ هُوَ حَىٌّ لاَ يَمُوتُ بِيَدِهِ الْخَيْرُ وَ هُوَ عَلٰى كُلِّ شَىْءٍ قَديرٌ';
String shahaadaRU =
    "Лаа илааха иллаллоху вахдахуу лаа шарийка лах, лахул-мулку валахул-хамду йухйи ва йумиит, ва хува хаййун лаа ямуут, биядихил-хойр, ва хува 'алаа кулли шай-ин кодиир";
String shahaadaDesk = ' (10 жолу окуп, 10-нун аягында)';
String uaIlayhilAR = 'وَ اِلَيْهِ الْمَصيرُ';
String uaIlayhilRU = 'ва илайхил-масыйр';
String uaIlayhilDeskRU = 'колдор которулуп, алакан томон каратылат';
String uaIlayhilDeskAR = 'then raise your hands and turn your palms down';
String azhirnaAR = 'اَللّٰهُمَّ اَجِرْنَا مِنَ النَّارِ';
String azhirnaRU = 'Аллоохумма ажирнаа минан-наар';
String azhirnaDeskAR = 'then recite the dua below';
String azhirnaDeskRU = 'окуп бүткөндөн кийин төмөндөгү дуба окулат';
String azhirnaLongAR =
    '❁ اَللّٰهُمَّ اَجِرْنَا مِنْ كُلِّ نَارٍ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ الدّينِيَّةِ وَ الدُّنْيَوِيَّةِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ اٰخِرِ الزَّمَانِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ الْمَسيحِ الدَّجَّالِ وَ السُّفْيَانِ\n❁ اَللّٰهُمَّ اَجِرْنَا مِنَ الضَّلاَلاَتِ وَ الْبِدْعِيَّاتِ وَ الْبَلِيَّاتِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ شَرِّ النَّفْسِ اْلاَمَّارَةِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ شُرُورِ النُّفُوسِ اْلاَمَّارَاتِ الْفِرْعَوْنِيَّةِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ شَرِّ النِّسَٓاءِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ بَلآَءِ النِّسَٓاءِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ النِّسَٓاءِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ الْقَبْرِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ يَوْمِ الْقِيٰمَةِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ جَهَنَّمَ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ قَهْرِكَ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ نَارِ قَهْرِكَ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ عَذَابِ الْقَبْرِ وَ النِّرَانِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنَ الرِّيَاءِ وَ السُّمْعَةِ وَ الْعُجُبِ وَ الْفَخْرِ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ تَجَاوُزِ الْمُلْحِدينَ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ شَرِّ الْمُنَافِقينَ \n❁ اَللّٰهُمَّ اَجِرْنَا مِنْ فِتْنَةِ الْفَاسِقينَ \n❁ اَللّٰهُمَّ اَجِرْنَا وَ اَجِرْ وَالِدَيْنَا وَ طَلَبَةَ رَسَٓائِلِ النُّورِ الصَّدِقينَ فى خِدْمَةِ الْقُرْاٰنِ وَ اْلايمَانِ وَ اَحْبَابَنَا الْمُؤْمِنينَ الْمُخْلِصينَ وَ اَقْرِبَٓائَنَا وَ اَجْدَادَنَا مِنَ النَّارِ';
String azhirnaLongRU =
    "❁ Аллоохумма ажирнаа мин кулли наар.\n❁ Аллоохумма ажирнаа мин фитнатид-дииниййати вад-дунйавиййа.\n❁ Аллоохумма ажирнаа мин фитнати аахириз замаан.\n❁ Аллоохумма ажирнаа мин фитнатил масийхид-дажжаали вас-суфйаан.\n❁ Аллоохумма ажирнаа минад-долаалати вал бид'иййати вал балиййаат.\n❁ Аллоохумма ажирнаа мин шаррин нафсил аммаро.\n❁ Аллоохумма ажирнаа мин шуруурин нуфуусил аммаароотил фир'авниййа.\n❁ Аллоохумма ажирнаа мин шаррин нисаа.\n❁ Аллоохумма ажирнаа мин балаа-ин нисаа.\n❁ Аллоохумма ажирнаа мин фитнатин нисаа.\n❁ Аллоохумма ажирнаа мин 'азабил кобр.\n❁ Аллоохумма ажирнаа мин 'азааби яумил кыййаама.\n❁ Аллоохумма ажирнаа мин 'азааби жаханнам.\n❁ Аллоохумма ажирнаа мин 'азааби кохрик.\n❁ Аллоохумма ажирнаа мин наари кохрик.\n❁ Аллоохумма ажирнаа мин 'азабил кобри ван нийроон.\n❁ Аллоохумма ажирнаа минар рийаа-и вас сум'ати вал'ужуби вал фахр.\n❁ Аллоохумма ажирнаа мин тажаавузил мулхидиин.\n❁ Аллоохумма ажирнаа мин шаррил мунаафикиин.\n❁ Аллоохумма ажирнаа мин фитнатил фаасикиин.\n❁ Аллоохумма ажирнаа ва ажир ваалидайнаа ва толабата Росаа-илин нуурис-соодикийна фий хидматил кур-аани вал-иймаан, ва ахбаабанал му-миниинал мухлисыйна ва акрибаа-анна ва аждааданаа минан наар.";
String beforebiawFikaRU = 'ушул жерде алакандар жогору каратылат';
String beforebiawFikaAR = 'here the palms are facing up';
String biawfikaAR = 'بِعَفْوِكَ يَا مُجِيرُ بِفَضْلِكَ يَا غَفَّرُ';
String maalAbrorAR = 'اَللَّهُمَّ اَدْخِلْنَا اجَنَّةَ مَعَ الْاَبْرَارِ';
String maalAbrorRU = "Аллоохумма адхинал жанната ма'ал аброор.";
String biawfikaRU = "Би 'афвика йаа Мужиир, бифадлика йаа Гоффаар.";
String biawfikaDesk = '\n(бул 3 жолу айтылат)';
String adhilnaAR =
    '❁ اَللَّهُمَّ اَدْخِلْنَا وَ اَدْخِلْ اُسْتَاذَنَا وَوَالِدَيْنَا وَطَلَبَةَ رَسَآءِلِ النُّورِ الصَّادِقِينَا وَ اِخْوَنَنَا وَ اَخَوَاتَنَا وَ اَقْرِبَآءَنَا وَ اَجْدَادَنَا وَاَحْبَابَنَا الْمُؤْمِنِينَ الْمُخْلِصِينَ فِى خِدْمَةِ الْاِيمَانِ وَالْقُرْاأَنِ \n❁ الْجَنَّةَ مَعَ الْاَبْرَارِ بِشَفَاعَةِ نَبِيِّكَ الْمُخْتَارِ وَاأَلِهِ الْاَطْهَارِ وَ اَصْحَابِهِ الْاَخْيَرِ وَسَلَّمْ مَا دَامَ اللَّيْلُ وَالنَّهَارُ \n❁ أَمِيْنَ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ';
String adhilnaRU =
    "Аллоохумма адхилнаа ва адхил устаазанаа ва ваалидайнаа ва толабата росса-илин нуурис соодикийна ва ихваананаа ва аховаатанаа ва акрибаа-анаа ва аждааданаа ва ахбаабанал му-миниинал мухлисыйна фий хидматил  иймаани вал кур-аан, ал жанната  ма'ал аброор, би шафаа'aти набиййикал мухтаар ва аалихил атхаар ва асхаабихил ахйаар васаллим маа даамал  лайлу ван нахаар. Аамиин, вал хамду лиллаахи Роббил 'ааламиин.";
String adhilnaDesk = ' (Алакандар бетке суртулот)';
String navAferAdhilna = 'Анан намаздын аягындагы тасбихке отобуз:';
String subhanAllohiAR =
    '❁ سُبْحَانَ اللهِ وَالْحَمْدُ ِللهِ وَلآَاِلٰهَ اِلاََّ الله ُ وَالله ُ اَكْبَرُ \n❁ وَلاَحَوْلَ وَلاَقُوَّةَ اِلاَّبِاللهِ الْعَلِيِّ الْعَظِيمِ';
String subhanAllohiRU =
    "Субхааналлохи вал хамду лиллаахи ва лаа илааха иллаллооху валлоху акбар, ва лаа хавла ва лаа куввата иллаа биллахил 'алиййил 'азыйм.";
String subhanAllohiDesk = ' деп айтылат жана «Аятал Курси» окулат:';
String bismiAR = 'بِسْـــــمِ اللهِ الرَّحْمٰنِ الرَّحِيـمِ';
String bismiRU = 'Бисмиллаахир Рахмаанир Рахиим.';
String ayatulKursiAR =
    '❁ اَلله ُلآَ اِلَهَ اِلاَّ هُوَ الْحَيُّ اْلقَيُّومُ \n❁ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ \n❁ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي اْلأَرْضِ \n❁ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ اِلاَّ بِإِذْنِهِ \n❁ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ \n❁ وَلاَ يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ اِلاَّ بِمَا شَآءَ \n❁ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَاْلأَرْضَ \n❁ وَلاَ يَؤُدُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ';
String ayatulKursiRU =
    "Аллаху ля иляха илля хуаль хаййюль къайюм, ля тахузуху синнатун ва ля наум. Ляху ма фий ссаммавати ва ма филь ардъ, ман заллязий яшфа'у индаху илля биизнихи, я'аляму ма байна айдихим ва ма хъальфахум, ва ля юхийтуна бишейин мин 'ильмихи илля бима шаа васи'а курсийюху ссаммвати валь ард, ва ля йаудуху хифзухума ва хуаль 'алиюль 'азъыйм";
String ayatulKursiDesk = '';
String navAfterAyatulKursi = 'Намаз тасбихтери айтылат: ';
String subhanaAllohAR = 'سُُبْحَانَ اللّٰهِ';
String subhanaAllohRU = 'Субхааналлоох';
String subhanaAllohDesk = ' (33 жолу),';
String alhamdulillahAR = 'اَلْحَمْدُ لِلّٰهِ';
String alhamdulillahRU = 'Алхамду лиллаах';
String alhamdulillahDesk = ' (33 жолу),';
// ignore: non_constant_identifier_names
String AllohuAkbarAR = 'اَللّٰهُ اَكْبَرُ';
// ignore: non_constant_identifier_names
String AllohuAkbarRU = 'Аллооху акбар';
// ignore: non_constant_identifier_names
String AllohuAkbarDesk = ' (33 жолу),';
String uahdahuAR =
    '❁ آَاِلٰهَ اِلاَّاللّٰهُ وَحْدَهُ لاَشَرِ يكَ لَهُ\n❁ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِى وَيُمِيتُ\n❁ وَهُوَالْحَيُّ الَّذِي لاَيَمُوتُ بِيَدِهِﭐلْخَيْرُ\n❁ وَهُوَ عَلٰى كُلِّ شَىْءٍقَدِيرٌ\n❁ وَاِلَيْهِ الْمَصِيرُ';
String uahdahuRU =
    "Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул мулку  ва лахул хамду йухйии ва йумиит, ва хува хаййун лаа ямуут, биядихил хойр, ва хува 'алаа кулли  шай-ин кодиир ва илайхил масыйр";
String falamAR = 'فَاعْلَمْ اَنَّهُ';
String falamRU = "Фа'лам аннаху";
String falamDesk = ' (1 жолу),';
String lailahaAR = 'لآَاِلٰهَ اِلاَّالله';
String lailahaRU = 'Лаа илааха иллаллоох';
String lailahaDesk =
    ' (33 жолу окулат. Каалагандар багымдат жана куптан намаздардан кийин 100 жолу окуса болот.)';
// ignore: non_constant_identifier_names
String MuhammadAR =
    'مُحَمَّدٌ رَسُولُ اللّٰهِ صَلَّى اللّٰهُ تَعَالٰى عَلَيْهِ وَ سَلَّمَ';
// ignore: non_constant_identifier_names
String MuhammadRU =
    "Мухаммадун Расуулуллоохи соллаллооху та'аала 'алайхи ва саллам";
// ignore: non_constant_identifier_names
String MuhammadDesk = '(делет)';
String navAfterMuhammad = '*Тасбихаттагы салаату-саламда  р окулат:';

String afterMuhammadAR =
    'لآَاِلٰهَ اِلاَّالله ُ اَلْمَلِكُ الْحَقُّ الْمُبِينُ ❁ مُحَمَّدٌرَسُولُﭐللهِ صَادِقُ الْوَعْدِ اْلاَمِينُ';
String afterMuhammadRU =
    "Лаа илааха иллаллоохул маликул хаккул мубиин, Мухаммадун расуулуллоохис соодикул ва'дил амиин.";

String afterMuhammadDesk =
    "(Багымдат намазда гана 10 жолу окулат.)\nТасбихаттагы салаату-саламдар окулат:";

String innAllohAR =
    '❁ اِنَّ اللّٰهَ وَ مَلَٓئِكَتَهُ يُصَلُّونَ عَلَى النَّبِىِّ يَٓا اَيُّهَا الَّذينَ اٰمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْليمًا \n❁ لَبَّيْكَ';
String solliAlAR =
    '❁ اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَٓاءٍ وَدَوَٓاءٍ وَبَارِكْ وَسَلِّمْ عَلَيْهِ وَعَلَيْهِمْ تَسْلِيمًا كَثِيرًا \n❁ اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَٓاءٍ وَدَوَٓاءٍ وَبَارِكْ وَسَلِّمْ عَلَيْهِ وَعَلَيْهِمْ تَسْلِيمًا كَثِيرًا \n❁ اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِ سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَٓاءٍ وَدَوَٓاءٍ وَبَارِكْ وَسَلِّمْ عَلَيْهِ وَعَلَيْهِمْ تَسْلِيمًا كَثِيرًا كَثِيرً';
String solliAlRU =
    "❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийроо.\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийроо.\n❁ Аллоохумма солли 'aлаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би'адади кулли дааин ва даваа-ин ва баарик васаллим 'алайхи ва 'aлайхим касийрон касийроо.";
String afterSolliAR =
    '❁ صَلِّ وَ سَلِّمْ يَا رَبِّ عَلٰى حَبيبِكَ مُحَمَّدٍ وَ عَلٰى جَميعِ اْلاَنْبِيَٓاءِ وَ لْمُرْسَلينَ وَ عَلَٓى اٰلِ كُلٍّ وَ صَحْبِ كُلٍّ اَجْمَعينَ اٰمينَ وَالْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمينَ';
String afterSolliRU =
    "❁ Солли васаллим йаа Робби'алаа хабийбика Мухаммадин ва'алаа жамии'ил анбийаа-и вал мурсалиин, ва'алаа аали куллин ва сохби куллин ажма'иин. Аамиин, вал хамду лиллаахи Роббил'ааламин.";
String alfuAlfiAR =
    '❁ اَلْفُ اَلْفِ صَلاَةٍ وَ اَلْفُ اَلْفِ سَلاَمٍ عَلَيْكَ يَا رَسُولَ اللّٰهِ\n❁ اَلْفُ اَلْفِ صَلاَةٍ وَ اَلْفُ اَلْفِ سَلاَمٍ عَلَيْكَ يَا حَب۪يبَ اللّٰهِ \n❁ اَلْفُ اَلْفِ صَلاَةٍ وَ اَلْفُ اَلْفِ سَلاَمٍ عَلَيْكَ يَٓا اَمينَ وَحْىِ اللّٰهِ';
String alfuAlfiRU =
    "❁ Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа расуулаллоох.\n❁ Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа хабиибаллоох.\n❁ Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа амиина вахйиллаах.";
String afterAlfiAR =
    'اَللّٰهُمَّ صَلِّ وَ سَلِّمْ وَ بَارِكْ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلَٓى اٰلِه وَ اَصْحَابِه بِعَدَدِ اَوْرَاقِ اْلاَشْجَارِ وَ اَمْوَاجِ الْبِحَارِ وَ قَطَرَاتِ اْلاَمْطَارِ وَ اغْفِرْلَنَا وَ ارْحَمْنَا وَ الْطُفْ بِنَا وَ بِاُسْتَادِنَا سَعيدِ النُّورْسى رَضِىَ اللّٰهُ عَنْهُ وَ وَالِدَيْنَا وَ بِطَلَبَةِ رَسَٓائِلِ النُّورِ الصَّدِقينَ يَٓا اِلٰهَنَا بِكُلِّ صَلاَةٍ مِنْهَٓا اَشْهَدُ اَنْ لآَ اِلٰهَ اِلاَّ اللّٰهُ وَ اَشْهَدُ اَنَّ مُحَمَّدًا رَسُولُ اللّٰهِ صَلَّى اللّٰهُ تَعَالٰى عَلَيْهِ وَ سَلَّمْ';
String afterAlfiRU =
    "❁ Аллоохумма солли васаллим ва баарик 'алаа саййидинаа Мухаммадин ва 'алаа аалихи ва асхаабих, би адади авроокил ашжаари ва амваажил бихаари ва катороотил амтоор, вагфир ланаа варxамнаа валтуф бинаа ва би устаазинаа ва ваалидайнаа ва битолабати росаа-илин нуурис-соодикиин, йаа илааханаа би кулли солаатин минхаа шахаадах, ашхаду ан лаа илааха иллаллоох, ва ашхаду анна Мухаммадан Расуулуллоохи соллаллооху та'аала 'алайхи ва саллам.";
String innAllohRU =
    "❁ Инналлооха ва малаа-икатахуу йусоллууна 'алан набийй, йаа аййухаллазийна аамануу соллуу 'алайхи васаллимуу таслиймаа...\n❁ Лаббайк!";
String innAllohDesk = '';
String navAfterInnAlloh = '';
String subhanakaYaaAllahAR =
    'سُبْحَانَك يَٓا اَللّٰهُ تَعَالَيْتَ يَا رَحْمٰنُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا رَح۪يمُ تَعَالَيْتَ يَا كَر۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَم۪يدُ تَعَالَيْتَ يَا حَك۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مَج۪يدُ تَعَالَيْتَ يَا مَلِكُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰن \nسُبْحَانَكَ يَا قُدُّوسُ تَعَالَيْتَ يَا سَلاَمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُؤْمِنُ تَعَالَيْتَ يَا مُهَيْمِنُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَز۪يزُ تَعَالَيْتَ يَا جَبَّارُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُتَكَبِّرُ تَعَالَيْتَ يَا خَالِقُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَٓا اَوَّلُ تَعَالَيْتَ يَٓا اٰخِرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا ظَاهِرُ تَعَالَيْتَ يَا بَاطِنُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا بَارِىءُ تَعَالَيْتَ يَا مُصَوِّرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا تَوَّابُ تَعَالَيْتَ يَا وَهَّابُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا بَاعِثُ تَعَالَيْتَ يَا وَارِثُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا قَد۪يمُ تَعَالَيْتَ يَا مُق۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا فَرْدُ تَعَالَيْتَ يَا وِتْرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا نُورُ تَعَالَيْتَ يَا سَتَّارُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا جَل۪يلُ تَعَالَيْتَ يَا جَم۪يلُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا قَاهِرُ تَعَالَيْتَ يَا قَادِرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مَل۪يكُ تَعَالَيْتَ يَا مُقْتَدِرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَل۪يمُ تَعَالَيْتَ يَا عَلاَّمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَظ۪يمُ تَعَالَيْتَ يَا غَفُورُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَل۪يمُ تَعَالَيْتَ يَا وَدُودُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا شَه۪يدُ تَعَالَيْتَ يَا شَاهِدُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا كَب۪يرُ تَعَالَيْتَ يَا مُتَعَالُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا نُورُ تَعَالَيْتَ يَا لَط۪يفُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا سَم۪يعُ تَعَالَيْتَ يَا كَف۪يلُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا قَر۪يبُ تَعَالَيْتَ يَا بَص۪يرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَقُّ تَعَالَيْتَ يَا مُب۪ينُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا رَؤُفُ تَعَالَيْتَ يَا رَح۪يمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا طَاهِرُ تَعَالَيْتَ يَا مُطَهِّرُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُجَمِّلُ تَعَالَيْتَ يَا مُفَضِّلُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا مُظْهِرُ تَعَالَيْتَ يَا مُنْعِمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا دَيَّانُ تَعَالَيْتَ يَا سُلْطَانُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَنَّانُ تَعَالَيْتَ يَا مَنَّانُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَٓا اَحَدُ تَعَالَيْتَ يَا صَمَدُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا حَىُّ تَعَالَيْتَ يَا قَيُّومُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا عَدْلُ تَعَالَيْتَ يَا حَكَمُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ \nسُبْحَانَكَ يَا فَرْدُ تَعَالَيْتَ يَا قُدُّوسُ اَجِرْنَا مِنَ النَّارِ بِعَفْوِكَ يَا رَحْمٰنُ';
String palmUpAR = beforebiawFikaAR + ' again';
String aahiyanAR =
    'سُبْحَانَكَ اٰهِيًّا شَرَاهِيًّا تَعَالَيْتَ لآَ اِلٰهَ اِلآَّ اَنْتَ اَجِرْنَا وَ اَجِرْ اُسْتَادَنَا سَعيدَ النُّورْسى رَضِىَ اللّٰهُ عَنْهُ وَ وَالِدَيْنَا وَ اِخْوَانَنَا وَ اَخَوَاتَنَا وَ طَلَبَةَ رَسَٓائِلِ النُّورِ وَ رُفَقَٓائَنَا وَ اَحْبَابَنَا الْمُخْلِصينَ مِنَ النَّارِ';
String aahiyanRU =
    "Субхаанака аахиййан шарооxиййан та'аалайта лаа илааха иллаа анта ажирнаа ва ажир устаазанаа ва ваалидайнаа ва ихваананаа ва аховаaтанаа ва толабата pocaa-илин нуури ва руфакоо-анаа ва акрибаа-анаа ва ахбаабанал мухлисыйна минан наар...";
String subhanakaRU = 'ушул жерде алакандар төмөн каратылат';
String subhanakaAR = 'here the palms are turned down';
String uaminKulliAR =
    'وَ مِنْ كُلِّ نَارٍ وَ احْفَظْنَا مِنْ شَرِّ النَّفْسِ وَ الشَّيْطَانِ وَ مِنْ شَرِّ الْجِنِّ وَ اْلاِنْسَانِ وَ مِنْ شَرِّ الْبِدْعَةِ وَ الضَّلاَلاَتِ وَ اْلاِلْحَادِ وَ الطُّغْيَانِ';
String uaminKulliRU =
    "...ва мин кулли наар, вахфазнаа мин шаррин нафси ваш шайтоон ва мин шаррил-жинни вал-инсаан ва мин шаррил бид'ати вад долаалаати вал-илхаади ват-тугйаан.";
String lastAR =
    'بِعَفْوِكَ يَا مُجيرُ بِفَضْلِكَ يَا غَفَّارُ بِرَحْمَتِكَ يَٓا اَرْحَمَ الرَّاحِمينَ\n❁ اَللّٰهُمَّ اَدْخِلْنَا الْجَنَّةَ مَعَ اْلاَبْرَارِ بِشَفَاعَةِ نَبِيِّكَ الْمُخْتَارِ اٰمينَ وَالْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمينَ';
String lastRU =
    "Би 'афвика йаа Мужиир, би фадлика йаа Гоффаар, би рахматика йаа архамар рохимиин. Аллоохумма адхилнал жанната ма'ал аброор, би шафаа'ати набиййикал мухтаар. Аамиин, вал хамду лиллаахи Роббил ааламиин.";
String khashrDeskRU = 'Хашр сүрөсүнүн 20-24 аяттары окулат';

String khashrDeskAR = 'Verses 20-24 of Surat Al-Hashr are recited';

String khashrAR =
    '❁ لَا يَسْتَوِىٓ أَصْحَـٰبُ ٱلنَّارِ وَأَصْحَـٰبُ ٱلْجَنَّةِ ۚ أَصْحَـٰبُ ٱلْجَنَّةِ هُمُ ٱلْفَآئِزُونَ\n❁ لَوْ أَنزَلْنَا هَـٰذَا ٱلْقُرْءَانَ عَلَىٰ جَبَلٍۢ لَّرَأَيْتَهُۥ خَـٰشِعًۭا مُّتَصَدِّعًۭا مِّنْ خَشْيَةِ ٱللَّهِ ۚ وَتِلْكَ ٱلْأَمْثَـٰلُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ \n❁ هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ۖ عَـٰلِمُ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ ۖ هُوَ ٱلرَّحْمَـٰنُ ٱلرَّحِيمُ\n❁  هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْمَلِكُ ٱلْقُدُّوسُ ٱلسَّلَـٰمُ ٱلْمُؤْمِنُ ٱلْمُهَيْمِنُ ٱلْعَزِيزُ ٱلْجَبَّارُ ٱلْمُتَكَبِّرُ ۚ سُبْحَـٰنَ ٱللَّهِ عَمَّا يُشْرِكُونَ \n❁ هُوَ ٱللَّهُ ٱلْخَـٰلِقُ ٱلْبَارِئُ ٱلْمُصَوِّرُ ۖ لَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ ۚ يُسَبِّحُ لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ ';
String khashrRU =
    "Лаа яставии асхаабун наaри ва асхаабул жанна, асхаабул жаннати хумул фаа-изуун. Лау анзалнаа хаазал кур-аана 'алаа жабалин ларо-айтаху хооши'ан мутасодди'ан мин хошйатиллаах, ва тилкал-амсаалу надрибухаа линнааси ла'аллахум ятафаккаруун. Хуваллоохуллазий лаа илааха иллаа хуу, 'Аалимул гойби вашшахаадати хувар Рохмаанир Рахиим. Хуваллоохуллазий лаа илааха иллаа хуу, ал Маликул Куддуусус Салаамул Му-минул Муxайминул Азийзул Жаббаарул Мутакаббир, Субхааналлоохи 'аммаа йушрикуун. Хуваллоохул Хооликул Баари-ул Мусоввиру лахул асмаа-ул хуснаа, йусаббиху лахуу маа фис самааваати вал-ард, ва хувал 'Азийзул Хакиим.";
String salavatAR = 'عَلىَ رَسُولِناَ مُحَمَّدٍ صَلَواَتٌ';
String salavarRU = 'Алаа Расулина Мухаммадин салават.';

String yaaRohmanAR =
    'يَاجَمِيلُ يَااَلله ُ \n❁ يَاقَرِيبُ يَااَلله ُ \n❁ يَامُجِيبُ يَااَلله ُ \n❁ يَاحَبِيبُ يَااَلله  ُ\n❁ يَارَؤُفُ يَااَلله ُ \n❁ يَاعَطُوفُ يَااَلله ُ \n❁ يَامَعْروُفُ يَااَلله ُ \n❁ يَالَطِيفُ يَااَلله  ُ\n❁ يَاعَظِيمُ يَااَلله ُ\n❁ يَاحَنَّانُُ يَااَلله ُ \n❁ يَامَنَّانُ يَااَلله ُ \n❁ يَادَيَّانُ يَااَلله ُ \n❁ يَاسُبْحَانُ يَااَلله ُ \n❁ يَاَاَمَانُ يَااَلله ُ \n❁ يَابُرْهَانُ يَااَلله ُ \n❁ يَاسُلطَانُ يَااَلله ُ \n❁ يَامُسْتَعَانُ يَااَلله ُ \n❁ يَامُحْسِنُ يَااَلله ُ \n❁ يَامُتَعَالُ يَااَلله ُ \n❁ يَارَحْمٰنُ يَااَلله ُ \n❁ يَارَحِيمُ  يَااَلله ُ \n❁ يَاكَرِيمُ يَااَلله ُ \n❁ يَامَجِيدُ يَااَلله ُ \n❁ يَافَرْدُ يَااَلله ُ \n❁ يَاوِتْرُ يَااَلله ُ \n❁ يَاَاَحَدُ يَااَلله ُ \n❁ يَاصَمَدُ  يَااَلله ُ \n❁ يَامَحْمُودُ يَااَلله ُ \n❁ يَاصَادِقَﭐلْوَعْدِ يَااَلله ُ \n❁ يَاعَلِىُّ يَااَلله ُ \n❁ يَاغَنِىُّ يَااَلله ُ \n❁ يَاشَاﰱِ يَااَلله ُ \n❁ يَاكَاﰱِ يَااَلله ُ \n❁ يَامُعَاﰱِ يَااَلله ُ \n❁ يَابَاقىِ يَااَلله ُ \n❁ يَاهَادِى يَااَلله ُ \n❁ يَاقَادِرُ يَااَلله ُ \n❁ يَاسَاتِرُ يَااَلله ُ \n❁ يَاقَهَّارُ يَااَلله ُ \n❁ يَاجَبَّارُ يَااَلله ُ \n❁ يَاقَهَّارُ يَااَلله ُ \n❁ يَاجَبَّارُ يَااَلله ُ \n❁ يَاغَفَّارُ يَااَلله ُ \n❁ يَافَتَّاحُ يَااَلله ُ';
String yaaRohmanRU =
    "❁ Йаа Жамиилу йаа Аллаах \n❁ Йaa Кориибу йаа Аллаах \n❁ Йaa Мужиибу йаа Аллаах \n❁ Йаа Хабиибу йаа Аллаах \n❁ Йaa Po-ууфу йаа Аллаах \n❁ Йаа 'Атууфу йаа Аллаах \n❁ Йaa Ma'рууфу йаа Аллаах \n❁ Йaa Латыйфу йаа Аллаах \n❁ Йаа 'Азыйму йаа Аллаах \n❁ Йаа Ханнаану йаа Аллаах \n❁ Йаа Маннаану йаа Аллаах \n❁ Йаа Даййаану йаа Аллаах \n❁ Йаа Субхаану йаа Аллаах \n❁ Йаа Амаану йаа Аллаах \n❁ Йаа Бурхаану йаа Аллаах \n❁ Йаа Султоону йаа Аллаах \n❁ Йаа Муста'аану йаа Аллаах \n❁ Иаа Мухсину йаа Аллаах \n❁ Йаа Мута'аалу йаа Аллаах \n❁ Йаа Рохмаану йаа Аллаах \n❁ Йаа Рохийму йаа Аллаах \n❁ Йaa Карийму йаа Аллаах \n❁ Йаа Мажииду йаа Аллаах \n❁ Йаа Фарду йаа Аллаах \n❁ Йaa Витру йаа Аллаах \n❁ Йаа Ахаду йаа Аллаах \n❁ Йаа Сомаду йаа Аллаах \n❁ Йаа Махмууду йаа Аллаах \n❁ Йаа Соодикал Ва'ди йаа Аллаах \n❁ Йаа 'Алиййу йаа Аллаах \n❁ Йаа Гониййу йаа Аллаах \n❁ Йаа Шаафи йаа Аллаах \n❁ Йаа Каафи йаа Аллаах \n❁ Йaa My'аафи йаа Аллаах \n❁ Йаа Бааки йаа Аллаах \n❁ Йaa Хаади йаа Аллаах \n❁ Йaa Kooдиру йаа Аллаах \n❁ Йaa Caaтиру йаа Аллаах \n❁ Йаа Коххаару йаа Аллаах \n❁ Йaa Жаббаару йаа Аллаах \n❁ Йаа Гоффаару йаа Аллаах \n❁ Йаа Фаттаху йаа Аллаах";

String yaaRobbasAR =
    '❁ يَارَبَّ السَّمٰوَاتِ وَاْلاَرْضِ يَاذَالْجَلاَلِ وَاْلاِكْرَامِ \n❁  نَسْئَلُكَ بِحَقِّ هٰذِهِ اْلاَسْمَآءِ كُلِّهَآ اَنْ تُصَلِّىَ عَلىٰ سَيِّدِنَا مُحَمَّدٍ وَ عَلىٰ ٰالِ سَيِّدِنَا مُحَمَّدٍ \n❁ وَارْحَمْ مُحَمَّداً كَمَا صَلَّيْتَ وَسَلَّمْتَ وَبَارَكْتَ وَرَحِمْتَ وَتَرَحَّمْتَ عَلىٰ سَيِّدِنَا اِبرَاهِيمَ وَعَلىٰ ٰالِ سَيِّدِنَا اِبرَاهِيمَ ﰱِ ﭐلْعَالَمِينَ \n❁ ربَّناَ اِنَّكَ حَمِيدٌ مجَِيدٌ \n❁ بِرَحْمَتِكَ يَآاَرْحَمَ الرَّاحِمِينَ \n❁ وَالْحَمْدُ ِللهِ رَبِّ الْعَالَمِينَ';
String yaaRobbasRU =
    "❁ Йаа Роббас самааваати вал арди, йаа зал-жалаали вал икроом.\n❁ Нас-алука би хакки хаазихил асмаа и куллиха ан тусаллийа 'алаа саййидинаа Мухаммадин ва 'алаа аали Мухаммад.\n❁ Вархам Мухаммадан камаа соллайта ва салламта ва баарoкта ва рохимта ва тароххамта 'алаа Иброоxийма ва 'алаа аали Иброоxийма фил 'ааламиин.\n❁ Роббанаа иннака Хамийдун Мажиид.\n❁ Би рохматика йаа архамар рохимиин.\n❁ Вал хамду лиллаахи Роббил ааламиин.";

String fathDeskRU = 'Фатх сүрөсүнүн 27-29 аяттары окулат';

String fathDeskAR = 'Verses 27-29 of Surat Al-Fath are recited';

String fathRU =
    "❁ Лакод содакАллооху росуулахур ру-йаа бил хакк, латадхулуннал масжидал хароома иншаа-Аллооху ааминийна мухалликыйна ру-уусакум ва мукассырийна лаа тахоофуун, фа 'алима маа лам та'ламуу фажа'ала мин дууни заалика фатхан корийбаа.\n❁ Хувaллaзий арсала расуулахуу бил худаа ва дийнил хакки ли йузхирахуу 'алад дийни куллих, ва кафаа биллаахи шаxийдаа.\n❁ Мухаммадур расуулулоох, валлазийна ма'ахуу ашиддаа-у 'алал куффаари рухамаа-у байнахум, тароохум рукка'ан сужжадан ябтагууна фадлан миналлоохи ва ридваанаа, сиймаахум фий вужуухихим мин асарис сужууд, Заалика масалухум фит таврооти ва масалухум фил инжиил, казар-ин ахрожа шат-аху фа аазарахуу фастаглазо фaстaвaa 'алаа суукихии йу'жибуззурраа'а ли йагийзо бихимул куффаар, ва адАл- Лоохул лазийна аамануу ва амилус соолиxаати минхум магфиротав ва ажрон азыймаа.";

String fathAR =
    '❁ لَّقَدْ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءْيَا بِٱلْحَقِّ ۖ لَتَدْخُلُنَّ ٱلْمَسْجِدَ ٱلْحَرَامَ إِن شَآءَ ٱللَّهُ ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمْ وَمُقَصِّرِينَ لَا تَخَافُونَ ۖ فَعَلِمَ مَا لَمْ تَعْلَمُوا۟ فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتْحًۭا قَرِيبًا \n❁ هُوَ ٱلَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِٱلْهُدَىٰ وَدِينِ ٱلْحَقِّ لِيُظْهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ ۚ وَكَفَىٰ بِٱللَّهِ شَهِيدًۭا \n❁ مُّحَمَّدٌۭ رَّسُولُ ٱللَّهِ ۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلْكُفَّارِ رُحَمَآءُ بَيْنَهُمْ ۖ تَرَىٰهُمْ رُكَّعًۭا سُجَّدًۭا يَبْتَغُونَ فَضْلًۭا مِّنَ ٱللَّهِ وَرِضْوَٰنًۭا ۖ سِيمَاهُمْ فِى وُجُوهِهِم مِّنْ أَثَرِ ٱلسُّجُودِ ۚ ذَٰلِكَ مَثَلُهُمْ فِى ٱلتَّوْرَىٰةِ ۚ وَمَثَلُهُمْ فِى ٱلْإِنجِيلِ كَزَرْعٍ أَخْرَجَ شَطْـَٔهُۥ فَـَٔازَرَهُۥ فَٱسْتَغْلَظَ فَٱسْتَوَىٰ عَلَىٰ سُوقِهِۦ يُعْجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلْكُفَّارَ ۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنْهُم مَّغْفِرَةًۭ وَأَجْرًا عَظِيمًۢا';
String nabaAR =
    '❁ إِنَّ لِلْمُتَّقِينَ مَفَازًا \n❁ حَدَآئِقَ وَأَعْنَـٰبًۭا \n❁ وَكَوَاعِبَ أَتْرَابًۭا \n❁ وَكَأْسًۭا دِهَاقًۭا \n❁ لَّا يَسْمَعُونَ فِيهَا لَغْوًۭا وَلَا كِذَّٰبًۭا\n❁ جَزَآءًۭ مِّن رَّبِّكَ عَطَآءً حِسَابًۭا \n❁ رَّبِّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ٱلرَّحْمَـٰنِ ۖ لَا يَمْلِكُونَ مِنْهُ خِطَابًۭا \n❁ يَوْمَ يَقُومُ ٱلرُّوحُ وَٱلْمَلَـٰٓئِكَةُ صَفًّۭا ۖ لَّا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ ٱلرَّحْمَـٰنُ وَقَالَ صَوَابًۭا \n❁ ذَٰلِكَ ٱلْيَوْمُ ٱلْحَقُّ ۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ مَـَٔابًا \n❁ إِنَّآ أَنذَرْنَـٰكُمْ عَذَابًۭا قَرِيبًۭا يَوْمَ يَنظُرُ ٱلْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ ٱلْكَافِرُ يَـٰلَيْتَنِى كُنتُ تُرَٰبًۢا';
String nabaRU =
    "❁ Инна лил муттакийна мафаазан хадаа-ико ва а'наабаа, ва каваа'иба атрообаа, ва каа-сан дихаакоо.\n❁ Лаа йасма'ууна фийхаа лагвав валаа киззаабаа, жазаа-ан мин Роббика 'атоо-ан хисаабаа.\n❁ Роббис самааваати вал арди вамаа байнахумар Рохмаани лаа йаамликууна минху хитообаа.\n❁ Йаума якуумур рууху вал малаа-икату соффаа, лаа ятакалламууна иллаа ман азина лахур Рохмаану ва коола соваабаа.\n❁ Зааликал йаумул хакк, фаман шаа-аттахоза илаа Роббихии ма-аабаа.\n❁ Иннаа анзарна акум азаабан Кориибаа, йаума йаанзурул мар-у маа коддамат ядааху ва якуулул каафиру йаа лайтании кунту турообаа.";
String nabaDeskRU = 'Наба сүрөсүнүн 31-40 аяттары окулат';

String nabaDeskAR = 'Verses 31-40 of Surat Al-Naba are recited';

String bakaraDeskAR = 'Verses 285-286 of Surat Al-Baqarah are recited';

String bakaraDeskRU = "Бакара сүрөсүнүн 285-286 аяттары окулат";

String bakaraAR =
    '❁ ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّن رُّسُلِهِۦ ۚ وَقَالُوا۟ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ \n❁ لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًۭا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ';

String bakaraRU =
    "Ааманар расуулу бимаа унзила илайхи мир Роббихии вал му-минуун, куллун аамана биллаахи ва малаа-икатихий ва кутубихии ва русулих, лаа нуфаррику байна аxадим мир-русулих, вакоолуу сами'наа ва ато'наа гуфроонака Роббанаа ва илайкал масыйр. Лаа йукаллифуллооху нафсан иллаа вус'ахаа, лахаа маа касабат ва 'алайхаа мактасабат, Роббанаа лаа ту-аахизнаа ин насийнаа ав ахто-наа, Роббанаа ва лаа тахмил 'алайнаа исрон камаа хамалтахуу 'алал лазийна мин коблинаа,Роббанаа ва лаа тухаммилнаа маа лаа тоокота ланаа бих, ва'фу 'аннаа вагфир ланаа варxамнаа, анта Мавлаанаа фансурнаа 'алал ковмил каафириин.";
